#+Title: The Computer and Its Parts
#+Author: Mikael Svahnberg
#+Email: Mikael.Svahnberg@bth.se
#+Date: 2025-03-26
#+EPRESENT_FRAME_LEVEL: 1
#+OPTIONS: email:t <:t todo:t f:t ':t H:2
#+STARTUP: beamer, num

#+LATEX_CLASS_OPTIONS: [10pt,t,a4paper]
#+BEAMER_THEME: BTH2025


** Java source and compiled
#+begin_src bash :results output
  cat ~/Documents/Play/JavaPonies/src/JavaPonies.java | head -20
  echo "--------------------"
  hexdump -C ~/Documents/Play/JavaPonies/out/JavaPonies.class | head -20
#+end_src

#+RESULTS:
#+begin_example
import java.util.Properties;
import java.io.*;

import model.PonyContainer;
import view.MainWindow;
import view.PonyWindow;

/** 
 ,* Startup class for the JavaPonies program.
 ,* Reads the CONFIGFILE <i>rootDir/resources/javaponies.cfg</i>
 ,*
 ,* Based on the Mono implementaion of Desktop Ponies
 ,* https://github.com/RoosterDragon/Desktop-Ponies/tree/master
 ,* Artwork included with this program is licensed under [Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Unported (CC BY-NC-SA 3.0)](https://creativecommons.org/licenses/by-nc-sa/3.0/).
 ,* This means you are allowed to share and alter the artwork, provided you give credit, do not use it for commercial purposes and release it under this same license.
 ,* [My Little Pony: Friendship is Magic](https://wikipedia.org/wiki/My_Little_Pony:_Friendship_Is_Magic) and sound files taken from the show are Copyright of [Hasbro](https:////www.hasbro.com/).
 ,*
 ,*
 ,* @author Mikael Svahnberg
 ,* @version 1.0
--------------------
00000000  ca fe ba be 00 00 00 41  00 56 0a 00 02 00 03 07  |.......A.V......|
00000010  00 04 0c 00 05 00 06 01  00 10 6a 61 76 61 2f 6c  |..........java/l|
00000020  61 6e 67 2f 4f 62 6a 65  63 74 01 00 06 3c 69 6e  |ang/Object...<in|
00000030  69 74 3e 01 00 03 28 29  56 07 00 08 01 00 14 6a  |it>...()V......j|
00000040  61 76 61 2f 75 74 69 6c  2f 50 72 6f 70 65 72 74  |ava/util/Propert|
00000050  69 65 73 0a 00 07 00 03  09 00 0b 00 0c 07 00 0d  |ies.............|
00000060  0c 00 0e 00 0f 01 00 0a  4a 61 76 61 50 6f 6e 69  |........JavaPoni|
00000070  65 73 01 00 08 6d 79 43  6f 6e 66 69 67 01 00 16  |es...myConfig...|
00000080  4c 6a 61 76 61 2f 75 74  69 6c 2f 50 72 6f 70 65  |Ljava/util/Prope|
00000090  72 74 69 65 73 3b 07 00  11 01 00 12 6a 61 76 61  |rties;......java|
000000a0  2f 69 6f 2f 46 69 6c 65  52 65 61 64 65 72 08 00  |/io/FileReader..|
000000b0  13 01 00 0e 6a 61 76 61  70 6f 6e 69 65 73 2e 63  |....javaponies.c|
000000c0  66 67 0a 00 10 00 15 0c  00 05 00 16 01 00 15 28  |fg.............(|
000000d0  4c 6a 61 76 61 2f 6c 61  6e 67 2f 53 74 72 69 6e  |Ljava/lang/Strin|
000000e0  67 3b 29 56 0a 00 07 00  18 0c 00 19 00 1a 01 00  |g;)V............|
000000f0  04 6c 6f 61 64 01 00 13  28 4c 6a 61 76 61 2f 69  |.load...(Ljava/i|
00000100  6f 2f 52 65 61 64 65 72  3b 29 56 07 00 1c 01 00  |o/Reader;)V.....|
00000110  13 6a 61 76 61 2f 69 6f  2f 49 4f 45 78 63 65 70  |.java/io/IOExcep|
00000120  74 69 6f 6e 07 00 1e 01  00 13 6d 6f 64 65 6c 2f  |tion......model/|
00000130  50 6f 6e 79 43 6f 6e 74  61 69 6e 65 72 0a 00 1d  |PonyContainer...|
#+end_example

** C/C++ source and compiled
#+begin_src bash :results output
  echo "--------------------"
  cat ~/Documents/Play/st/x.c | head -20
  echo "--------------------"
  hexdump -C ~/Documents/Play/st/st | head -20
#+end_src

#+RESULTS:
#+begin_example
--------------------
/* See LICENSE for license details. */
#include <errno.h>
#include <math.h>
#include <limits.h>
#include <locale.h>
#include <signal.h>
#include <sys/select.h>
#include <time.h>
#include <unistd.h>
#include <libgen.h>
#include <X11/Xatom.h>
#include <X11/Xlib.h>
#include <X11/cursorfont.h>
#include <X11/keysym.h>
#include <X11/Xft/Xft.h>
#include <X11/XKBlib.h>

char *argv0;
#include "arg.h"
#include "st.h"
--------------------
00000000  7f 45 4c 46 02 01 01 00  00 00 00 00 00 00 00 00  |.ELF............|
00000010  03 00 3e 00 01 00 00 00  00 59 00 00 00 00 00 00  |..>......Y......|
00000020  40 00 00 00 00 00 00 00  a8 96 01 00 00 00 00 00  |@...............|
00000030  00 00 00 00 40 00 38 00  0d 00 40 00 26 00 25 00  |....@.8...@.&.%.|
00000040  06 00 00 00 04 00 00 00  40 00 00 00 00 00 00 00  |........@.......|
00000050  40 00 00 00 00 00 00 00  40 00 00 00 00 00 00 00  |@.......@.......|
00000060  d8 02 00 00 00 00 00 00  d8 02 00 00 00 00 00 00  |................|
00000070  08 00 00 00 00 00 00 00  03 00 00 00 04 00 00 00  |................|
00000080  18 03 00 00 00 00 00 00  18 03 00 00 00 00 00 00  |................|
00000090  18 03 00 00 00 00 00 00  1c 00 00 00 00 00 00 00  |................|
000000a0  1c 00 00 00 00 00 00 00  01 00 00 00 00 00 00 00  |................|
000000b0  01 00 00 00 04 00 00 00  00 00 00 00 00 00 00 00  |................|
000000c0  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
000000d0  b0 45 00 00 00 00 00 00  b0 45 00 00 00 00 00 00  |.E.......E......|
000000e0  00 10 00 00 00 00 00 00  01 00 00 00 05 00 00 00  |................|
000000f0  00 50 00 00 00 00 00 00  00 50 00 00 00 00 00 00  |.P.......P......|
00000100  00 50 00 00 00 00 00 00  31 95 00 00 00 00 00 00  |.P......1.......|
00000110  31 95 00 00 00 00 00 00  00 10 00 00 00 00 00 00  |1...............|
00000120  01 00 00 00 04 00 00 00  00 f0 00 00 00 00 00 00  |................|
00000130  00 f0 00 00 00 00 00 00  00 f0 00 00 00 00 00 00  |................|
#+end_example

